# Загрузка библиотек

In [1]:
import pandas as pd
import numpy as np

# Препроцессинг

In [2]:
train_df = pd.read_csv('data/train.csv')
test_df = pd.read_csv('data/test.csv')

### Общая информация о данных

In [3]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

### Количество пропущенных значений для каждого признака

In [5]:
train_df.isnull().sum() / len(train_df)

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

Только 3 признака имеют пропущенные значения:
- _Age_ - почти 20%
- _Cabin_ - чуть больше 70%
- _Embarked_ - меньше 1%

In [6]:
test_df.isnull().sum() / len(test_df)

PassengerId    0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.205742
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.002392
Cabin          0.782297
Embarked       0.000000
dtype: float64

Только 3 признака имеют пропущенные значения:
- _Age_ - чуть больше 20%
- _Fare_ - меньше 1%
- _Cabin_ - чуть больше 75%

Возраст, вероятно, является важным признаком, поэтому просто удалить его нельзя. Что бы заполнить пропущенные значения я воспользуюсь средним значением по признаку.

В то же время, номер каюты пассажира имеет примерно 77% пропущенных значений и для тренировочного и для тестового набора данных. Маловероятно, что при таком кол-ве пропущенных значений, с его помощью можно получить какую-то репрезентативную информацию. Этот признак можно удалить.

Признак _Embarked_ или порт, в который пассажир сел на борт, является категориальным и может принимать только 3 значения. К тому же кол-во пропущенных значений крайне мало. Было бы неразумно не заполнить их с помощью моды.

Стоимость билета так же имеет мало пропущенных значений и они могут быть заполнены средним.

### Заполнение пропущенных значений, удаление ненужных признаков

In [7]:
values = {'Age' : train_df.Age.mean(),
          'Embarked' : train_df.Embarked.mode()[0],
          'Fare' : train_df.Fare.mean()}

In [8]:
train_df.fillna(value=values, inplace=True)
test_df.fillna(value=values, inplace=True)

In [9]:
train_df.drop(['Name', 'Ticket', 'Cabin'], inplace=True, axis=1)
test_df.drop(['Name', 'Ticket', 'Cabin'], inplace=True, axis=1)

Признаки Name и Ticket являются уникальными для каждого пассажира, значит не несут в себе какой либо полезной информации. Про признак Cabin я писал ранее.

### Сохранение данных

In [10]:
train_df.to_csv('data/preprocessed_data/train.csv', index=False)
test_df.to_csv('data/preprocessed_data/test.csv', index=False)